Tekla Open API Reference for Tekla Structures 2025
ProfileItem.ModifyCrossSection Method
 Modifies the cross section of a profile.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ModifyCrossSection(
	int CrossSectionNumber,
	double Location,
	int Type,
	int SubType
)
Public Function ModifyCrossSection (
	CrossSectionNumber As Integer,
	Location As Double,
	Type As Integer,
	SubType As Integer
) As Boolean
Parameters
CrossSectionNumber
Type: System.Int32
The cross section number.
Location
Type: System.Double
The Location value.
Type
Type: System.Int32
The type number.
SubType
Type: System.Int32
The subtype number.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Tekla.Structures.Catalogs.ProfileItem.ModifyCrossSection(System.Int32,System.Double,System.Int32,System.Int32)"]
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace